In [1]:
import pandas as pd

### Excel sheet 07.10 "Trip Characteristics"

In [2]:
df_10= pd.read_excel("section07.xls", sheet_name="07.10")
#(e.g. “A:E” or “A,C,E:F”)
print(df_10)

                             Unnamed: 0    Unnamed: 1    Unnamed: 2  \
0                                   NaN           NaN           NaN
1                                   NaN           NaN           NaN
2                                   NaN           NaN           NaN
3                                   NaN           NaN           NaN
4                                   NaN           NaN           NaN
5                                   NaN           NaN           NaN
6                                   NaN           NaN           NaN
7                                   NaN           NaN           NaN
8                                   NaN           NaN           NaN
9                                   NaN  2.065689e+06  6.656779e+06
10                                  NaN           NaN           NaN
11                  Purpose of visit 1/           NaN           NaN
12                       Pleasure (net)  1.585412e+06  5.734311e+06
13                             Vacation  1.537844e+06  5.515116e+06
14                            Honeymoon  4.746113e+04  2.338577e+05
15                  Wedding/Get Married  1.430059e+04  4.534982e+04
16  Meetings, conventions, incentive 1/  9.937194e+04  9.538994e+04
17                Convention/conference  6.325789e+04  4.306084e+04
18                    Corporate meeting  2.147340e+04  2.817941e+04
19                            Incentive  1.790867e+04  2.782640e+04
20                       Other business  9.564378e+04  1.432338e+05
21           Visit friends or relatives  3.149518e+05  8.232686e+05
22               Government or military  3.497155e+04  5.663027e+04
23                        Attend school  6.972997e+03  1.499786e+04
24                          Sport event  1.364241e+04  1.833693e+04
25                                  NaN           NaN           NaN
26                      Traveler method           NaN           NaN
27                           Group tour  4.010146e+04  8.351203e+04
28                              Package  2.425189e+05  9.192191e+05
29                     True independent  1.805154e+06  5.694152e+06
30                                  NaN           NaN           NaN
31                       Accommodations           NaN           NaN
32                                Hotel  9.733389e+05  3.461805e+06
33                           Hotel only  8.181045e+05  3.010088e+06
34                                Condo  3.695491e+05  1.286219e+06
35                           Condo only  2.994723e+05  1.057556e+06
36                            Timeshare  1.882075e+05  6.757413e+05
37                       Timeshare only  1.491365e+05  5.566026e+05
38                         Rental house  2.560914e+05  7.979448e+05
39                               Hostel  1.676442e+04  3.261810e+04
40                            Camp site  1.679986e+04  3.256271e+04
41                      Bed & breakfast  2.735834e+04  6.709277e+04
42                          Cruise ship  2.192602e+04  1.723226e+03
43                   Friends, relatives  3.431115e+05  7.959866e+05

       Unnamed: 3     Unnamed: 4
0             NaN            NaN
1             NaN            NaN
2             NaN            NaN
3             NaN            NaN
4             NaN            NaN
5             NaN            NaN
6             NaN            NaN
7             NaN            NaN
8             NaN            NaN
9        612384.0  120981.000000
10            NaN            NaN
11            NaN            NaN
12  535053.683588   97479.808440
13  493663.237684   92525.661922
14    41520.12573    5031.331542
15    6238.264466     523.977561
16   33069.673806    1853.243024
17   14589.942349     559.668598
18    2922.741449     703.019068
19   16189.623401     624.318168
20    3869.829622    1856.115196
21   25984.270631   14045.000654
22    1966.249914    2980.238670
23    1781.713841     721.719024
24    3279.050518     524.447429
25            NaN            NaN
26            NaN            NaN
27           (NA)    1269.353199
28           (NA)    9615.254535
29           (NA)  110736.352381
30            NaN            NaN
31            NaN            NaN
32  441040.954235   56871.777872
33  397682.842822   50205.465155
34  106933.791697   31549.390794
35   78340.136083   27229.893869
36   29539.361331    9229.778090
37   21556.965541    7342.589221
38    33250.26952    7778.792477
39    3633.115736    1197.613877
40    3251.838926     817.025767
41    6229.677459     542.133851
42    2711.776703     106.911099
43   31259.561674   18756.936990

Drop empty cells

In [3]:
deduped_df_10 = df_10.dropna()
deduped_df_10.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
12,Pleasure (net),1.585412e+06,5.734311e+06,535053.683588,97479.808440
13,Vacation,1.537844e+06,5.515116e+06,493663.237684,92525.661922
14,Honeymoon,4.746113e+04,2.338577e+05,41520.12573,5031.331542
15,Wedding/Get Married,1.430059e+04,4.534982e+04,6238.264466,523.977561
16,"Meetings, conventions, incentive 1/",9.937194e+04,9.538994e+04,33069.673806,1853.243024

In [4]:
dropped_df_10 = deduped_df_10.drop([12,13,14,15,16,17,18,19,20,21,22,23,24,27,28,29,33,35,37,39,40,42,43])
print(dropped_df_10)

         Unnamed: 0     Unnamed: 1    Unnamed: 2     Unnamed: 3    Unnamed: 4
32            Hotel  973338.860840  3.461805e+06  441040.954235  56871.777872
34            Condo  369549.099056  1.286219e+06  106933.791697  31549.390794
36        Timeshare  188207.496859  6.757413e+05   29539.361331   9229.778090
38     Rental house  256091.399255  7.979448e+05    33250.26952   7778.792477
41  Bed & breakfast   27358.341130  6.709277e+04    6229.677459    542.133851

Rename columns and reset index

In [5]:
dropped_df_10.columns = ['Type', 'Domestic 2020', 'Domestic 2021','International 2020','International 2021']
rwdropped_df_10 = dropped_df_10.reset_index(drop=True)
print(rwdropped_df_10)

              Type  Domestic 2020  Domestic 2021 International 2020  \
0            Hotel  973338.860840   3.461805e+06      441040.954235
1            Condo  369549.099056   1.286219e+06      106933.791697
2        Timeshare  188207.496859   6.757413e+05       29539.361331
3     Rental house  256091.399255   7.979448e+05        33250.26952
4  Bed & breakfast   27358.341130   6.709277e+04        6229.677459

   International 2021
0        56871.777872
1        31549.390794
2         9229.778090
3         7778.792477
4          542.133851

### Excel sheet 07.07 "Visitor arrivals, by area visted"

In [6]:
df_7= pd.read_excel("section07.xls", sheet_name="07.07")
print(df_7)

         Unnamed: 0      Unnamed: 1      Unnamed: 2      Unnamed: 3  \
0               NaN             NaN             NaN             NaN
1               NaN             NaN             NaN             NaN
2               NaN             NaN             NaN             NaN
3               NaN             NaN             NaN             NaN
4               NaN             NaN             NaN             NaN
5               NaN             NaN            2020             NaN
6      Area visited           Total        Domestic  Inter-national
7               NaN             NaN             NaN             NaN
8      State total   2678072.861446  2065688.861462        612384.0
9               NaN             NaN             NaN             NaN
10             Oahu  1506315.659653   998148.523944   508167.135718
11            Kauai   330262.667066   295842.755924    34419.911142
12      Maui County   807308.419573   706498.581754    100809.83782
13             Maui   792601.693654   693197.320885    99404.372769
14          Molokai    17024.986222    12998.553311     4026.432911
15            Lanai    17924.022199     15488.98345     2435.038749
16    Hawaii Island   493817.021415   402529.632083    91287.389332
17             Hilo   155032.741515   124359.793354    30672.948161
18             Kona   433193.992245   352567.633874    80626.358371
19  One island only  2311925.464449  1797842.149784   514083.314663
20        Oahu only  1212897.032808   794044.115331   418852.917476

        Unnamed: 4      Unnamed: 5      Unnamed: 6
0              NaN             NaN             NaN
1              NaN             NaN             NaN
2              NaN             NaN             NaN
3              NaN             NaN             NaN
4              NaN             NaN             NaN
5              NaN            2021             NaN
6            Total        Domestic  Inter-national
7              NaN             NaN             NaN
8   6777760.263237  6656779.263237        120981.0
9              NaN             NaN             NaN
10  3326622.092527  3250595.675265    76026.417262
11    813647.31792   807657.817604     5989.500316
12  2340914.931979  2298907.580889    42007.351091
13  2303941.517542  2262136.950777    41804.566766
14    25758.390803    25507.857103        250.5337
15     47829.24513    47290.640173      538.604956
16  1183457.998357  1172729.105042    10728.893315
17   293832.711127   291467.398143     2365.312984
18  1064571.439433   1054542.74088    10028.698553
19  5990063.982128   5880593.10609   109470.876038
20  2737924.661345  2671018.357009    66906.304337

Drop empty cells

In [7]:
deduped_df_7 = df_7.dropna()
deduped_df_7.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,2678072.861446,2065688.861462,612384.0,6777760.263237,6656779.263237,120981.0
10,Oahu,1506315.659653,998148.523944,508167.135718,3326622.092527,3250595.675265,76026.417262
11,Kauai,330262.667066,295842.755924,34419.911142,813647.31792,807657.817604,5989.500316
12,Maui County,807308.419573,706498.581754,100809.83782,2340914.931979,2298907.580889,42007.351091

Drop additional cells that are not necessary and not null

In [8]:
dropped_df_7 = deduped_df_7.drop([6,8,12,17,18,19,20])
print(dropped_df_7)

       Unnamed: 0      Unnamed: 1     Unnamed: 2     Unnamed: 3  \
10           Oahu  1506315.659653  998148.523944  508167.135718
11          Kauai   330262.667066  295842.755924   34419.911142
13           Maui   792601.693654  693197.320885   99404.372769
14        Molokai    17024.986222   12998.553311    4026.432911
15          Lanai    17924.022199    15488.98345    2435.038749
16  Hawaii Island   493817.021415  402529.632083   91287.389332

        Unnamed: 4      Unnamed: 5    Unnamed: 6
10  3326622.092527  3250595.675265  76026.417262
11    813647.31792   807657.817604   5989.500316
13  2303941.517542  2262136.950777  41804.566766
14    25758.390803    25507.857103      250.5337
15     47829.24513    47290.640173    538.604956
16  1183457.998357  1172729.105042  10728.893315

Rename columns

In [9]:
dropped_df_7.columns = ['Area Visited','Total 2020','Domestic 2020','International 2020','Total 2021','Domestic 2021','International 2021']
print(dropped_df_7)

     Area Visited      Total 2020  Domestic 2020 International 2020  \
10           Oahu  1506315.659653  998148.523944      508167.135718
11          Kauai   330262.667066  295842.755924       34419.911142
13           Maui   792601.693654  693197.320885       99404.372769
14        Molokai    17024.986222   12998.553311        4026.432911
15          Lanai    17924.022199    15488.98345        2435.038749
16  Hawaii Island   493817.021415  402529.632083       91287.389332

        Total 2021   Domestic 2021 International 2021
10  3326622.092527  3250595.675265       76026.417262
11    813647.31792   807657.817604        5989.500316
13  2303941.517542  2262136.950777       41804.566766
14    25758.390803    25507.857103           250.5337
15     47829.24513    47290.640173         538.604956
16  1183457.998357  1172729.105042       10728.893315

Reset and adjust index

In [10]:
dropped_df7 = dropped_df_7.reset_index(drop=True)
ridf7 = dropped_df7.drop(dropped_df7.columns[[0]],axis=1)
print(ridf7)

       Total 2020  Domestic 2020 International 2020      Total 2021  \
0  1506315.659653  998148.523944      508167.135718  3326622.092527
1   330262.667066  295842.755924       34419.911142    813647.31792
2   792601.693654  693197.320885       99404.372769  2303941.517542
3    17024.986222   12998.553311        4026.432911    25758.390803
4    17924.022199    15488.98345        2435.038749     47829.24513
5   493817.021415  402529.632083       91287.389332  1183457.998357

    Domestic 2021 International 2021
0  3250595.675265       76026.417262
1   807657.817604        5989.500316
2  2262136.950777       41804.566766
3    25507.857103           250.5337
4    47290.640173         538.604956
5  1172729.105042       10728.893315

### 2018/2019 Visitor Arrivals

In [11]:
df_7_2019= pd.read_excel("section07.2019.xlsx", sheet_name="07.07")
print(df_7_2019)

   Table 7.07-- VISITOR ARRIVALS, BY AREA VISITED:  2018 AND 2019  \
0                                                 NaN
1   [Covers visitors who arrived by air and stayed...
2     includes passengers from all flights origina...
3     includes passengers from all flights origina...
4                                                 NaN
5                                                 NaN
6                                        Area visited
7                                                 NaN
8                                        State total
9                                                 NaN
10                                               Oahu
11                                              Kauai
12                                        Maui County
13                                               Maui
14                                            Molokai
15                                              Lanai
16                                      Hawaii Island
17                                               Hilo
18                                               Kona
19                                    One island only
20                                          Oahu only
21                                                NaN
22                                                NaN
23       Source:  Hawaii Tourism Authority, Touris...
24  <https://www.hawaiitourismauthority.org/resear...
25                                       and records.

        Unnamed: 1      Unnamed: 2       Unnamed: 3       Unnamed: 4  \
0              NaN             NaN              NaN              NaN
1              NaN             NaN              NaN              NaN
2              NaN             NaN              NaN              NaN
3              NaN             NaN              NaN              NaN
4              NaN             NaN              NaN              NaN
5              NaN            2018              NaN              NaN
6           Total         Domestic  Inter-national             Total
7              NaN             NaN              NaN              NaN
8   9761448.055986  6736736.055989        3024712.0  10243165.024103
9              NaN             NaN              NaN              NaN
10  5862357.577556  3217740.281575    2644617.29598   6154248.093969
11  1389300.423018  1209338.377554    179962.045464   1370028.606504
12  2963564.075699  2473376.846713    490187.228987   3111131.460024
13  2914912.070158  2432853.608285    482058.461874   3059904.749288
14    58885.489912    42440.653487     16444.836425     63034.667872
15    75010.305614    54310.073018     20700.232597      84102.95976
16  1706217.780855  1291109.460392    415108.320463   1763904.023422
17   601159.812714   424719.609204     176440.20351    600490.325644
18  1488699.525585  1134812.912673    353886.612912   1553720.971394
19  8099892.222275  5627323.262461   2472568.959815   8595523.516356
20  4499507.321051  2372338.168146   2127169.152905   4799335.809374
21             NaN             NaN              NaN              NaN
22             NaN             NaN              NaN              NaN
23             NaN             NaN              NaN              NaN
24             NaN             NaN              NaN              NaN
25             NaN             NaN              NaN              NaN

        Unnamed: 5      Unnamed: 6
0              NaN             NaN
1              NaN             NaN
2              NaN             NaN
3              NaN             NaN
4              NaN             NaN
5             2019             NaN
6         Domestic  Inter-national
7              NaN             NaN
8   7253806.024038       2989359.0
9              NaN             NaN
10  3513070.170926  2641177.922997
11  1211259.804112   158768.802392
12   2650786.88681   460344.573213
13  2609797.643723   450107.105566
14    44304.320365    18730.347507
15    58799.108837    25303.850924
16  1361151.131748   402752.891676
17   438107.297595   162383.028049
18  1205698.079465   348022.891932
19  6114793.810327   2480729.70603
20  2638592.862547  2160742.946826
21             NaN             NaN
22             NaN             NaN
23             NaN             NaN
24             NaN             NaN
25             NaN             NaN

Drop nulls

In [12]:
deduped_df_7_2019 = df_7_2019.dropna()
deduped_df_7_2019.head()

,"Table 7.07-- VISITOR ARRIVALS, BY AREA VISITED: 2018 AND 2019",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,9761448.055986,6736736.055989,3024712.0,10243165.024103,7253806.024038,2989359.0
10,Oahu,5862357.577556,3217740.281575,2644617.29598,6154248.093969,3513070.170926,2641177.922997
11,Kauai,1389300.423018,1209338.377554,179962.045464,1370028.606504,1211259.804112,158768.802392
12,Maui County,2963564.075699,2473376.846713,490187.228987,3111131.460024,2650786.88681,460344.573213

Drop empties and rename columns

In [13]:
dropped_df_7_2019 = deduped_df_7_2019.drop([6,8,12,17,18,19,20])
dropped_df_7_2019.columns = ['Area Visited','Total 2018','Domestic 2018','International 2018','Total 2019','Domestic 2019','International 2019']
print(dropped_df_7_2019)
#print(tabulate(dropped_df_7_2019, headers='keys', tablefmt='plain', showindex=1))

     Area Visited      Total 2018   Domestic 2018 International 2018  \
10           Oahu  5862357.577556  3217740.281575      2644617.29598
11          Kauai  1389300.423018  1209338.377554      179962.045464
13           Maui  2914912.070158  2432853.608285      482058.461874
14        Molokai    58885.489912    42440.653487       16444.836425
15          Lanai    75010.305614    54310.073018       20700.232597
16  Hawaii Island  1706217.780855  1291109.460392      415108.320463

        Total 2019   Domestic 2019 International 2019
10  6154248.093969  3513070.170926     2641177.922997
11  1370028.606504  1211259.804112      158768.802392
13  3059904.749288  2609797.643723      450107.105566
14    63034.667872    44304.320365       18730.347507
15     84102.95976    58799.108837       25303.850924
16  1763904.023422  1361151.131748      402752.891676

Reset index

In [14]:
ridf7_2019 = dropped_df_7_2019.reset_index(drop=True)
print(ridf7_2019)

    Area Visited      Total 2018   Domestic 2018 International 2018  \
0           Oahu  5862357.577556  3217740.281575      2644617.29598
1          Kauai  1389300.423018  1209338.377554      179962.045464
2           Maui  2914912.070158  2432853.608285      482058.461874
3        Molokai    58885.489912    42440.653487       16444.836425
4          Lanai    75010.305614    54310.073018       20700.232597
5  Hawaii Island  1706217.780855  1291109.460392      415108.320463

       Total 2019   Domestic 2019 International 2019
0  6154248.093969  3513070.170926     2641177.922997
1  1370028.606504  1211259.804112      158768.802392
2  3059904.749288  2609797.643723      450107.105566
3    63034.667872    44304.320365       18730.347507
4     84102.95976    58799.108837       25303.850924
5  1763904.023422  1361151.131748      402752.891676

### Excel sheet 7.16 "Island experience"

In [15]:
df_16= pd.read_excel("section07.xls", sheet_name="07.16", usecols='A,B,C')
print(df_16)

   Table 7.16-- OVERALL ISLAND EXPERIENCE BY VISITORS FROM THE     Unnamed: 1  \
0     U.S. TOTAL, U.S. WEST, U.S. EAST, AND JAPAN:...                     NaN
1                                                 NaN                     NaN
2                                                 NaN                     NaN
3                                                 NaN                     NaN
4                                                 NaN                     NaN
5                                   Island and rating                     NaN
6                                                 NaN                     NaN
7                                                Oahu                     NaN
8                                                 NaN               Excellent
9                                                 NaN           Above average
10                                                NaN           Below average
11                                                NaN                    Poor
12                                                NaN                     NaN
13                                               Maui                     NaN
14                                                NaN               Excellent
15                                                NaN           Above average
16                                                NaN           Below average
17                                                NaN                    Poor
18                                                NaN                     NaN
19                                            Molokai                     NaN
20                                                NaN               Excellent
21                                                NaN           Above average
22                                                NaN           Below average
23                                                NaN                    Poor
24                                                NaN                     NaN
25                                              Lanai                     NaN
26                                                NaN               Excellent
27                                                NaN           Above average
28                                                NaN           Below average
29                                                NaN                    Poor
30                                                NaN                     NaN
31                      Hawai‘i (Hilo/ Kona/ Volcano)                     NaN
32                                                NaN               Excellent
33                                                NaN           Above average
34                                                NaN           Below average
35                                                NaN                    Poor
36                                                NaN                     NaN
37                                              Kauai                     NaN
38                                                NaN               Excellent
39                                                NaN           Above average
40                                                NaN           Below average
41                                                NaN                    Poor

    Unnamed: 2
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5   U.S. total
6          NaN
7          NaN
8     74.56781
9    17.021864
10      5.4093
11    3.001026
12         NaN
13         NaN
14   86.081271
15    9.136139
16    3.039964
17    1.742626
18         NaN
19         NaN
20   84.472353
21   10.185999
22    5.341648
23           0
24         NaN
25         NaN
26   86.019802
27     8.49379
28    3.349234
29    2.137174
30         NaN
31         NaN
32   85.196997
33   10.677396
34    3.289596
35    0.836011
36         NaN
37         NaN
38   83.793073
39   10.263686
40    4.155042
41    1.788199

Drop empty cells

In [16]:
dropped_df_16 = df_16.drop([0,1,2,3,4,5,6,8,12,14,18,23,24,30,36])
dropped_df_16.columns = ['Island','Rating', 'US Total']
print(dropped_df_16)

                           Island         Rating   US Total
7                            Oahu            NaN        NaN
9                             NaN  Above average  17.021864
10                            NaN  Below average     5.4093
11                            NaN           Poor   3.001026
13                           Maui            NaN        NaN
15                            NaN  Above average   9.136139
16                            NaN  Below average   3.039964
17                            NaN           Poor   1.742626
19                        Molokai            NaN        NaN
20                            NaN      Excellent  84.472353
21                            NaN  Above average  10.185999
22                            NaN  Below average   5.341648
25                          Lanai            NaN        NaN
26                            NaN      Excellent  86.019802
27                            NaN  Above average    8.49379
28                            NaN  Below average   3.349234
29                            NaN           Poor   2.137174
31  Hawai‘i (Hilo/ Kona/ Volcano)            NaN        NaN
32                            NaN      Excellent  85.196997
33                            NaN  Above average  10.677396
34                            NaN  Below average   3.289596
35                            NaN           Poor   0.836011
37                          Kauai            NaN        NaN
38                            NaN      Excellent  83.793073
39                            NaN  Above average  10.263686
40                            NaN  Below average   4.155042
41                            NaN           Poor   1.788199

Fill null cells that need to be kept

In [17]:
filled_df_16 = dropped_df_16.fillna('')
ri_filled_df_16 = filled_df_16.reset_index(drop=True)
print(ri_filled_df_16)

                           Island         Rating   US Total
0                            Oahu
1                                  Above average  17.021864
2                                  Below average     5.4093
3                                           Poor   3.001026
4                            Maui
5                                  Above average   9.136139
6                                  Below average   3.039964
7                                           Poor   1.742626
8                         Molokai
9                                      Excellent  84.472353
10                                 Above average  10.185999
11                                 Below average   5.341648
12                          Lanai
13                                     Excellent  86.019802
14                                 Above average    8.49379
15                                 Below average   3.349234
16                                          Poor   2.137174
17  Hawai‘i (Hilo/ Kona/ Volcano)
18                                     Excellent  85.196997
19                                 Above average  10.677396
20                                 Below average   3.289596
21                                          Poor   0.836011
22                          Kauai
23                                     Excellent  83.793073
24                                 Above average  10.263686
25                                 Below average   4.155042
26                                          Poor   1.788199

In [18]:
ri_filled_df_16 = pd.DataFrame({"Excellent": [74.6, 86.1, 84.5, 86.0, 85.2, 83.8],
                   "Above Average": [17.0, 9.1, 10.2, 8.5, 10.7, 10.3],
                   "Below Average": [5.4, 3.0, 5.3, 3.3, 3.3, 4.2],
                   "Poor": [3.0, 1.7, 0.0, 2.1, 0.8, 1.8]},
                  ["Oahu", "Maui", "Molokai", "Lanai", "Hawai'i","Kauai"])
ri_filled_df_16.reset_index(inplace=True)
print(ri_filled_df_16)

     index  Excellent  Above Average  Below Average  Poor
0     Oahu       74.6           17.0            5.4   3.0
1     Maui       86.1            9.1            3.0   1.7
2  Molokai       84.5           10.2            5.3   0.0
3    Lanai       86.0            8.5            3.3   2.1
4  Hawai'i       85.2           10.7            3.3   0.8
5    Kauai       83.8           10.3            4.2   1.8

### Excel sheet 34 "Average room prices"

In [19]:
df_34= pd.read_excel("section07.xls", sheet_name="07.34", usecols='A:B')
df_34.head()

,"Table 7.34-- VISITOR INDUSTRY PRICES, PRICE INDEXES, AND PRICE",Unnamed: 1
0,DEFLATOR: 1991 TO 2021,NaN
1,NaN,NaN
2,NaN,NaN
3,Year,Average daily room rate 1/ (dollars)
4,NaN,NaN

Drop empty cells

In [20]:
deduped_df_34 = df_34.dropna()
ridf_34 = deduped_df_34.reset_index(drop=True)
ridf_34.columns = ['Year', 'Avg Daily Room Rate']
print(ridf_34)

    Year                   Avg Daily Room Rate
0   Year  Average daily room rate 1/ (dollars)
1   1991                                101.89
2   1992                                105.59
3   1993                                103.26
4   1994                                105.46
5   1995                                109.39
6   1996                                116.79
7   1997                                124.96
8   1998                                129.66
9   1999                                131.66
10  2000                                140.63
11  2001                                144.88
12  2002                                140.89
13  2003                                144.16
14  2004                                152.17
15  2005                                166.16
16  2006                                187.19
17  2007                                199.96
18  2008                                201.85
19  2009                                 177.1
20  2010                                174.84
21  2011                                189.83
22  2012                                204.93
23  2013                                 229.9
24  2014                                234.85
25  2015                                244.64
26  2016                                254.03
27  2017                                264.49
28  2018                                278.07
29  2019                            283.052856
30  2020                                266.81
31  2021                                328.68

### 2019 Trip characteristics

In [21]:
df_10_2019= pd.read_excel("section07.2019.xlsx", sheet_name="07.10")
print(df_10_2019)

   Table 7.10-- TRIP CHARACTERISTICS OF VISITORS: 2018 AND 2019  \
0                                                 NaN
1   [Covers visitors who arrived by air and stayed...
2     includes passengers from all flights origina...
3     includes passengers from all flights origina...
4                                                 NaN
5                                                 NaN
6                                             Subject
7                                                 NaN
8                                     All visitors 1/
9                                                 NaN
10                                Purpose of visit 1/
11                                     Pleasure (net)
12                                           Vacation
13                                          Honeymoon
14                                Wedding/Get Married
15                Meetings, conventions, incentive 1/
16                              Convention/conference
17                                  Corporate meeting
18                                          Incentive
19                                     Other business
20                         Visit friends or relatives
21                             Government or military
22                                      Attend school
23                                        Sport event
24                                                NaN
25                                    Traveler method
26                                         Group tour
27                                            Package
28                                   True independent
29                                                NaN
30                                     Accommodations
31                                              Hotel
32                                         Hotel only
33                                              Condo
34                                         Condo only
35                                          Timeshare
36                                     Timeshare only
37                                       Rental house
38                                             Hostel
39                                          Camp site
40                                    Bed & breakfast
41                                        Cruise ship
42                                 Friends, relatives
43                                                NaN
44                                                NaN
45  1/  Because of multiple responses, detail may ...
46       Source:  Hawaii Tourism Authority, Touris...
47  <https://www.hawaiitourismauthority.org/resear...
48                                       and records.

        Unnamed: 1    Unnamed: 2      Unnamed: 3    Unnamed: 4
0              NaN           NaN             NaN           NaN
1              NaN           NaN             NaN           NaN
2              NaN           NaN             NaN           NaN
3              NaN           NaN             NaN           NaN
4              NaN           NaN             NaN           NaN
5         Domestic           NaN   International           NaN
6             2018  2.019000e+03            2018  2.019000e+03
7              NaN           NaN             NaN           NaN
8   6736736.055989  7.253806e+06       3024712.0  2.989359e+06
9              NaN           NaN             NaN           NaN
10             NaN           NaN             NaN           NaN
11  5594930.890898  6.057786e+06    2633642.9517  2.619941e+06
12  5369681.299388  5.833536e+06  2330693.528063  2.327895e+06
13   228615.301854  2.260048e+05   300775.463051  2.901876e+05
14    56653.590214  5.527781e+04    45859.204847  4.381943e+04
15   313516.551054  3.131850e+05    157856.71645  1.459857e+05
16   197447.773446  1.833994e+05    53147.084771  4.731704e+04
17      70672.7558  7.634092e+04      9904.33716  1.523434e+04
18    56307.705396  6.415818e+04    98035.433189  8.520230e+04
19   240717.942301  2.528426e+05    17284.816742  1.834243e+04
20   709184.067266  7.513774e+05    84621.918074  8.453023e+04
21    91142.961729  8.701993e+04    13101.928439  1.670822e+04
22    14142.725609  1.494816e+04    11700.235919  1.056804e+04
23    65796.348921  6.876657e+04    26169.442782  2.909063e+04
24             NaN           NaN             NaN           NaN
25             NaN           NaN             NaN           NaN
26   164704.126959  1.636167e+05   342425.024516  3.214359e+05
27   1206398.06852  1.249443e+06   1318659.50227  1.341724e+06
28  5465283.707661  5.938291e+06  1629209.560199  1.571521e+06
29             NaN           NaN             NaN           NaN
30             NaN           NaN             NaN           NaN
31  3581232.304172  3.863229e+06   2282953.81996  2.250648e+06
32  2990087.233111  3.263870e+06  2064530.724652  2.051159e+06
33  1190791.492733  1.245480e+06   480816.011134  4.542847e+05
34   938986.492104  9.980504e+05   348485.492694  3.378014e+05
35   681247.976325  6.946531e+05   161084.190767  1.587284e+05
36   530577.641803  5.487710e+05   120354.672696  1.200913e+05
37    805128.55348  8.890611e+05   147929.794685  1.477591e+05
38    53491.153891  5.581139e+04      28009.5403  2.967859e+04
39    46250.911142  5.024300e+04    12502.669189  1.360033e+04
40    87610.869913  9.458986e+04    29547.190859  2.426145e+04
41   108900.234612  1.180525e+05    25793.772079  2.523569e+04
42   790992.720227  8.374156e+05    86634.382741  9.923894e+04
43             NaN           NaN             NaN           NaN
44             NaN           NaN             NaN           NaN
45             NaN           NaN             NaN           NaN
46             NaN           NaN             NaN           NaN
47             NaN           NaN             NaN           NaN
48             NaN           NaN             NaN           NaN

In [22]:
deduped_df_10_2019 = df_10_2019.dropna()
deduped_df_10_2019.columns = ['Type', 'Domestic 2018', 'Domestic 2019','International 2018','International 2019']
deduped_df_10_2019.head()

,Type,Domestic 2018,Domestic 2019,International 2018,International 2019
6,Subject,2018,2.019000e+03,2018,2.019000e+03
8,All visitors 1/,6736736.055989,7.253806e+06,3024712.0,2.989359e+06
11,Pleasure (net),5594930.890898,6.057786e+06,2633642.9517,2.619941e+06
12,Vacation,5369681.299388,5.833536e+06,2330693.528063,2.327895e+06
13,Honeymoon,228615.301854,2.260048e+05,300775.463051,2.901876e+05

In [23]:
dropped_df_10_2019 = deduped_df_10_2019.drop([6,8,11,12,13,14,15,16,17,18,19,20,21,22,23,26,27,28,32,34,36,38,39,41,42])
ridropped_df_10_2019 = dropped_df_10_2019.reset_index(drop=True)
final_table_10 = ridropped_df_10_2019.drop(ridropped_df_10_2019.columns[[0]],axis=1)
print(final_table_10)

    Domestic 2018  Domestic 2019 International 2018  International 2019
0  3581232.304172   3.863229e+06      2282953.81996        2.250648e+06
1  1190791.492733   1.245480e+06      480816.011134        4.542847e+05
2   681247.976325   6.946531e+05      161084.190767        1.587284e+05
3    805128.55348   8.890611e+05      147929.794685        1.477591e+05
4    87610.869913   9.458986e+04       29547.190859        2.426145e+04

convert to CSV

In [24]:
ri_filled_df_16.to_csv('stats_table16.csv', header=None, encoding = "utf-8")
deduped_df_34.to_csv('stats_table34.csv',header=None, encoding = "utf-8")

combine dataframes concat()

In [25]:
table_10 = pd.concat([rwdropped_df_10,final_table_10], axis=1, join='inner',sort=True)
print(table_10)

              Type  Domestic 2020  Domestic 2021 International 2020  \
0            Hotel  973338.860840   3.461805e+06      441040.954235
1            Condo  369549.099056   1.286219e+06      106933.791697
2        Timeshare  188207.496859   6.757413e+05       29539.361331
3     Rental house  256091.399255   7.979448e+05        33250.26952
4  Bed & breakfast   27358.341130   6.709277e+04        6229.677459

   International 2021   Domestic 2018  Domestic 2019 International 2018  \
0        56871.777872  3581232.304172   3.863229e+06      2282953.81996
1        31549.390794  1190791.492733   1.245480e+06      480816.011134
2         9229.778090   681247.976325   6.946531e+05      161084.190767
3         7778.792477    805128.55348   8.890611e+05      147929.794685
4          542.133851    87610.869913   9.458986e+04       29547.190859

   International 2019
0        2.250648e+06
1        4.542847e+05
2        1.587284e+05
3        1.477591e+05
4        2.426145e+04

In [26]:
table_10.to_csv('final_table_10.csv', encoding = "utf-8")

Table 7 concat()

In [27]:
table_7 = pd.concat([ridf7_2019,ridf7], axis =1,join = 'inner', sort=True)
print(table_7)

    Area Visited      Total 2018   Domestic 2018 International 2018  \
0           Oahu  5862357.577556  3217740.281575      2644617.29598
1          Kauai  1389300.423018  1209338.377554      179962.045464
2           Maui  2914912.070158  2432853.608285      482058.461874
3        Molokai    58885.489912    42440.653487       16444.836425
4          Lanai    75010.305614    54310.073018       20700.232597
5  Hawaii Island  1706217.780855  1291109.460392      415108.320463

       Total 2019   Domestic 2019 International 2019      Total 2020  \
0  6154248.093969  3513070.170926     2641177.922997  1506315.659653
1  1370028.606504  1211259.804112      158768.802392   330262.667066
2  3059904.749288  2609797.643723      450107.105566   792601.693654
3    63034.667872    44304.320365       18730.347507    17024.986222
4     84102.95976    58799.108837       25303.850924    17924.022199
5  1763904.023422  1361151.131748      402752.891676   493817.021415

   Domestic 2020 International 2020      Total 2021   Domestic 2021  \
0  998148.523944      508167.135718  3326622.092527  3250595.675265
1  295842.755924       34419.911142    813647.31792   807657.817604
2  693197.320885       99404.372769  2303941.517542  2262136.950777
3   12998.553311        4026.432911    25758.390803    25507.857103
4    15488.98345        2435.038749     47829.24513    47290.640173
5  402529.632083       91287.389332  1183457.998357  1172729.105042

  International 2021
0       76026.417262
1        5989.500316
2       41804.566766
3           250.5337
4         538.604956
5       10728.893315

In [28]:
table_7.to_csv('table_7.csv', encoding = "utf-8")

In [29]:
#df1 = pd.DataFrame([[12,13,14]], columns=['A','B','C'])
df1a = pd.DataFrame([[12,13,14]], columns=['R','S','T'])
df2 = pd.DataFrame([[2,3,4]], columns=['A','B','C'])
#pd.concat([df2, df1], axis=1)
pd.concat([df2, df1a], axis=1)

# How to reindex rows
# How to add column headings (add a new row at index 0)
# How to drop a column
df2.columns = ['R','S','T']
print(df2)

   R  S  T
0  2  3  4

In [30]:
# How to reindex rows
#rwdf1 = dropped_df_10.reset_index(drop=True)
# How to add column headings
#rwdf1.columns = ['type','X','R','S','T']
# How to remove a column
#rwdf2 = rwdf1.drop(rwdf1.columns[[1]],axis=1)
#rwdf2 = rwdf1.drop(['Unnamed: 1'],axis=1)
#print(rwdf1.columns[[1]])
#print(rwdf2)

### Excel 7.20 Length of Stay

In [31]:
df_20= pd.read_excel("section07.xls", sheet_name="07.20", usecols= 'B,E')
ridf_20 = df_20.reset_index(drop=True)
deduped_df_20= df_20.dropna()
ridf_20 = deduped_df_20.reset_index(drop=True)
ridf_20.columns = ['Total2020', 'Total2021']

print(ridf_20)

      Total2020     Total2021
0  8.249247e+05  1.646689e+06
1  1.347321e+06  4.144625e+06
2  4.287652e+05  8.953182e+05
3  7.706178e+04  9.112833e+04
4  7.469456e+00  9.636262e+00
5  1.064825e+01  7.536350e+00

In [32]:
df_21= pd.read_excel("section07.2019.xlsx", sheet_name="07.21", usecols='A:B,E')
deduped_df_21= df_21.dropna()
dropped_df_21 = deduped_df_21.drop([7])
ridf_21 = dropped_df_21.reset_index(drop=True)
ridf_21.columns = ['Length of Stay','Total2018', 'Total2019']
print(ridf_21)

   Length of Stay       Total2018       Total2019
0     1 to 6 days  3217754.841509  3553982.366434
1    7 to 12 days  5189750.910168  5404047.055278
2   13 to 30 days  1262487.501006  1198791.383059
3  31 to 365 days    91454.803277    86344.219199
4   Median (days)        7.287957        7.159104
5     Mean (days)        8.986843        8.756319

In [33]:
table20 = pd.concat([ridf_21, ridf_20], axis =1,join = 'inner', sort=True)
print(table20)
table20.to_csv('table_20.csv', encoding = "utf-8")

   Length of Stay       Total2018       Total2019     Total2020     Total2021
0     1 to 6 days  3217754.841509  3553982.366434  8.249247e+05  1.646689e+06
1    7 to 12 days  5189750.910168  5404047.055278  1.347321e+06  4.144625e+06
2   13 to 30 days  1262487.501006  1198791.383059  4.287652e+05  8.953182e+05
3  31 to 365 days    91454.803277    86344.219199  7.706178e+04  9.112833e+04
4   Median (days)        7.287957        7.159104  7.469456e+00  9.636262e+00
5     Mean (days)        8.986843        8.756319  1.064825e+01  7.536350e+00

In [34]:
df_2122= pd.read_excel("section21.xlsx", sheet_name="21.22", usecols='A:B')
deduped_df_2122 = df_2122.dropna()
ridf_2122 = deduped_df_2122.reset_index(drop=True)
ridf_2122.columns = ['Neighborhoods','Total Housing Units']
print(ridf_2122)

ridf_2122.to_csv('table_2122.csv', header = None, encoding= "utf-8")

                  Neighborhoods  Total Housing Units
0                  1 Hawaii Kai              11410.0
1         2 Kuliouou-Kalani Iki               6072.0
2              3 Waialae-Kahala               4161.0
3                     4 Kaimuki               6939.0
4       5 Diamond Head/Kapahulu               9298.0
5                      6 Palolo               4546.0
6                       7 Manoa               7646.0
7            8 McCully/Moiliili              14278.0
8                     9 Waikiki              18944.0
9            10 Makiki/Tantalus              17247.0
10         11 Ala Moana/Kakaako              15599.0
11          12 Nuuanu/Punchbowl               6843.0
12                  13 Downtown               7762.0
13           14 Liliha/Kapalama               7153.0
14             15 Kalihi-Palama              11387.0
15             16 Kalihi Valley               4708.0
16                  17 Moanalua               3225.0
17        18 Aliamanu/Salt Lake              13022.0
18                   19 Airport               6469.0
19                      20 Aiea              14448.0
20                21 Pearl City              11981.0
21                   22 Waipahu              20018.0
22                       23 Ewa              21268.0
23          24 Waianae Coast 2/               7918.0
24  25 Mililani/Waipio/Melemanu              11030.0
25                   26 Wahiawa              13928.0
26               27 North Shore               6750.0
27                 28 Koolauloa               4737.0
28                   29 Kahaluu               4705.0
29                   30 Kaneohe              12329.0
30                    31 Kailua              13989.0
31                 32 Waimanalo               2382.0
32                    33 Mokapu               2902.0
33         34 Makakilo/Kapolei/              15059.0
34                       Valley               6499.0
35        36 Nanakuli-Maili 2/                6136.0

In [35]:
df_2137= pd.read_excel("section21.xlsx", sheet_name="21.37", usecols='A,C,D')
deduped_df_2137 = df_2137.dropna()
ridf_2137 = deduped_df_2137.reset_index(drop=True)
dropped_df_2137 = ridf_2137.drop([0])
dropped_df_2137.columns = ['Year','Single Family', 'Condo']
print(dropped_df_2137)

dropped_df_2137.to_csv('table_2137.csv', header = None, encoding= "utf-8")

    Year Single Family  Condo
1   2008          8842   9971
2   2009          8384   7804
3   2010         11073  10094
4   2011          7626   9466
5   2012          7544   8676
6   2013          8068   9766
7   2014          8075   9638
8   2015          8227  11128
9   2016          8239  11595
10  2017          8340  12134
11  2018          8632  11777
12  2019          9187  10923
13  2020          9518   9031
14  2021         12048  13922

In [36]:
df_19= pd.read_excel("section07.xls", sheet_name="07.19", usecols= 'A,B')
deduped_df_19 = df_19.dropna()
dropped_df_19 = deduped_df_19.drop([11,12,13,14,15,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,35,36,38,49,50,51,52,53,54,55,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,75,76,77,78,79,80,81,82,83,84])
ridf_19 = dropped_df_19.reset_index(drop=True)
ridf_19_2 = ridf_19.drop([3])

print(ridf_19_2)
ridf_19_2.to_csv('table_19.csv', header = None, encoding= "utf-8")

  Table 7.19-- VISITOR PROFILE AND TRIP CHARACTERISTICS OF VISITORS   \
0                                     Characteristic
1                                       First timers
2                                    Repeat visitors

   Unnamed: 1
0  U.S. total
1   23.790316
2   76.209684